spec/cassettes/Paymongo_Api_V1_PaymentIntentRecord/_retrieve/returns_the_payment_intent_from_Paymongo_API.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.paymongo.com/v1/payment_intents/pi_mFVmCm1xVzqgfv3S5A5KzVWV
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Authorization:
      - Basic c2tfdGVzdF8yekYxOFFDNmFlelNrc1BTRWV4eFl1Zk46
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sat, 05 Jun 2021 09:21:43 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Server:
      - nginx
      Vary:
      - Accept-Encoding
      - Origin
      Etag:
      - W/"8676e6f5931df116f7e7a3bc8dd89920"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 6700b0f9-253e-47bf-b285-571b99760b53
      X-Runtime:
      - '0.011527'
    body:
      encoding: ASCII-8BIT
      string: '{"data":{"id":"pi_mFVmCm1xVzqgfv3S5A5KzVWV","type":"payment_intent","attributes":{"amount":100000,"currency":"PHP","description":"Test
        Description","statement_descriptor":"Test Statement Descriptor","status":"awaiting_payment_method","livemode":false,"client_key":"pi_mFVmCm1xVzqgfv3S5A5KzVWV_client_Kny1Jx9tcpMqu8C34pHvCMnW","created_at":1622884903,"updated_at":1622884903,"last_payment_error":null,"payment_method_allowed":["card"],"payments":[],"next_action":null,"payment_method_options":{"card":{"request_three_d_secure":"any"}},"metadata":{"note2":"I
        love XRP","note1":"This is just a test"}}}}'
    http_version: 
  recorded_at: Sat, 05 Jun 2021 09:21:44 GMT
recorded_with: VCR 5.0.0
